/* Полезные ссылки
 * Принципы SOLID
 * https://pikabu.ru/story/solid_army_7082439?view=amp
 * https://habr.com/ru/company/productivity_inside/blog/505430/
 * 
 * Git (branching)
 * https://learngitbranching.js.org/?locale=ru_RU
 * 
 * 
 * Для итогового задания:
 * https://translate.yandex.ru/developers/keys
 * 
 * 1. Создать структуру из 5 классов (наследование) + БД
 * 2. Создать синглтон (вывести что-нибудь при его создании)
 * 3. Создать фабрику, повызывать для разных типов и вывести текст
 * 4. Прочитать про оставшиеся паттерны
 */
/* это вместо яндекса???
using Fluent.LibreTranslate;

GlobalLibreTranslateSettings.Server = LibreTranslateServer.Libretranslate_de;
GlobalLibreTranslateSettings.ApiKey = null; // if need an apiKey 
GlobalLibreTranslateSettings.UseRateLimitControl = true; //to avoid "429 Too Many Requests" exception
GlobalLibreTranslateSettings.RateLimitTimeSpan = TimeSpan.FromSeconds(4); //depends on server configuration, default 4 seconds

Console.WriteLine(await "Hello, World!".TranslateAsync(LanguageCode.Russian));
*/
